In [23]:
#Pandas Tips and Tricks (Common Operations)

In [18]:
import numpy as np
import pandas as pd

In [19]:
dict1 = {
    "name":['harry', 'rohan', 'rohit', 'barnak'],
    "marks":[70, 30, 70, 90],
    "city":['Rampur', 'kolkata', 'barily', 'antartica']
}

In [20]:
df = pd.DataFrame(dict1)

In [21]:
df

     name  marks       city
0   harry     70     Rampur
1   rohan     30    kolkata
2   rohit     70     barily
3  barnak     90  antartica

In [25]:
df.to_csv('friends.csv')

In [27]:
df.to_csv('friends_index_false.csv', index=False)

In [29]:
df.head(2)

    name  marks     city
0  harry     70   Rampur
1  rohan     30  kolkata

In [31]:
df.tail(2)

     name  marks       city
2   rohit     70     barily
3  barnak     90  antartica

In [33]:
df.describe()

           marks
count   4.000000
mean   65.000000
std    25.166115
min    30.000000
25%    60.000000
50%    70.000000
75%    75.000000
max    90.000000

In [36]:
barnak = pd.read_csv('sample_data.csv')

In [37]:
barnak

   column_a  column_b  column_c
0         1         1        10
1         2         4         8
2         3         9         6
3         4        16         4
4         5        25         2

In [39]:
barnak['column_b']

0     1
1     4
2     9
3    16
4    25
Name: column_b, dtype: int64

In [44]:
barnak.to_csv('sample_data.csv')